Revit 2027 API
AlignmentStationLabelOptions.Station Property
 Specifies the station at which the label will be placed, in Revit internal model units (standard Imperial feet). The station determines the location of the label's origin: Origin by setting it to the closest point on the alignment geometry which corresponds to this station.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Station { get; set; }
Public Property Station As Double
	Get
	Set
public:
property double Station {
	double get ();
	void set (double value);
}
member Station : float with get, set
Property Value
Double
See Also
Reference
AlignmentStationLabelOptions Class
Autodesk.Revit.DB.Infrastructure Namespace